load-tests/auth-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 5
scenarios:
  - name: "Register, Login, and Validate User"
    flow:
      - post:
          url: "/auth/register"
          json:
            username: "user{{ $randomInt(1, 1000) }}"
            password: "password{{ $randomInt(1, 1000) }}"
      - post:
          url: "/auth/login"
          json:
            username: "user{{ $randomInt(1, 1000) }}"
            password: "password{{ $randomInt(1, 1000) }}"
          capture:
            - as: "authToken"
              from: "json.token"
      - get:
          url: "/auth/validate"
          headers:
            Authorization: "Bearer {{ authToken }}"