load-tests/matchmaking-test.yml
config:
  target: "http://localhost:3002"
  phases:
    - duration: 60  # Run the test for 60 seconds
      arrivalRate: 10  # 10 requests per second
scenarios:
  - name: "Matchmaking Flow"
    flow:
      - post:
          url: "/matchmaking/queue"
          json:
            id: "player{{ $randomInt(1, 1000) }}"
            skill: "{{ $randomInt(1, 100) }}"
      - get:
          url: "/matchmaking/match"
          capture:
            - as: "matchDetails"
              from: "json.match"